Repository: Amereyeu/whaler
Catalog: po/*.po
Languages: ru

source: Manage your Docker containers
ru: Управляй Docker контейнерами

source: Docker Container Management
ru: Управление Docker контейнерами

source: Whaler provides basic functionality for managing Docker containers. The app can start and stop both standalone containers and docker-compose applications. Also, it supports viewing container logs.
ru: Whaler предоставляет базовый функционал для работы с Docker контейнерами. C его помощью Вы сможете запускать и останаваливать как отдельные контейнеры, так и docker-compose приложения. Также есть возможность просматривать логи контейнера.

source: The solution is perfect for those who are looking for a simple tool to perform some basic actions. For the app to run correctly, make sure that Docker is installed on your system.
ru: Это решение отлично подойдет тем кому нужен простой инструмент для базовых действий. Для корректной работы приложения, Docker должен быть установлен в системе.

source: Name
ru: Название

source: Type
ru: Тип

source: Close
ru: Закрыть

source: Settings
ru: Настройки

source: API socket path:
ru: Путь к API сокету:

source: Check connection
ru: Проверить соединение

source: Success
ru: Успешно

source: Error
ru: Ошибка

source: Incorrect socket path "%s"
ru: Некорректный путь к сокету "%s"

source: Running
ru: Запущен

source: Paused
ru: Приостановлен

source: Stopped
ru: Остановлен

source: Unknown
ru: Неизвестно

source: Image
ru: Образ

source: Status
ru: Статус

source: Ports
ru: Порты

source: Binds
ru: Пирвязки

source: Env
ru: Окружение

source: Back
ru: Назад

source: Update docker container list
ru: Обновить список docker контейнеров

source: Open settings
ru: Открыть настройки

source: It looks like Docker requires root rights to use it. Thus, the application cannot connect to Docker Engine API. Find out how to run docker without root rights in <a href="https://docs.docker.com/engine/install/linux-postinstall/">Docker Manuals</a>, otherwise the application cannot work correctly. Or check your socket path to Docker API in Settings.
ru: Похоже, что Docker требует root права для работы. Из-за этого приложение не может подключиться к Docker Engine API. Инструкция по запуску без root прав доступна в <a href="https://docs.docker.com/engine/install/linux-postinstall/">Docker Manuals</a>, иначе приложение не сможет работать корректно. Либо проверьте путь к сокету Docker API в настройках.

source: It looks like Docker is not installed on your system. To find out how to install it, see <a href="https://docs.docker.com/engine/install/">Docker Manuals</a>. Or check your socket path to Docker API in Settings.
ru: Похоже, что Docker не установлен в вашей системе. Инструкция по установке доступна в <a href="https://docs.docker.com/engine/install/">Docker Manuals</a>. Либо проверьте путь к сокету Docker API в настройках.

source: The app cannot connect to Docker API
ru: Приложение не может подключиться к Docker API

source: Autoscroll
ru: Автоскролл

source: Enable autoscroll to bottom border
ru: Включить автоскролл к нижней границе

source: Start
ru: Запустить

source: Stop
ru: Остановить

source: Unpause
ru: Запустить

source: Pause
ru: Пауза

source: Container pause error
ru: Ошибка остановки контейнера

source: Restart
ru: Перезапустить

source: Container restart error
ru: Ошибка перезапуска контейнера

source: Restarting container
ru: Идет перезапуск контейнера

source: Remove
ru: Удалить

source: Do you really want to remove container?
ru: Вы действительно хотите удалить контейнер?

source: Yes, remove
ru: Да, удалить

source: Cancel
ru: Отмена

source: Container remove error
ru: Ошибка удаления контейнера

source: Removing container
ru: Идет удаление контейнера

source: Info
ru: Информация

source: Cannot get information
ru: Приложение не может получить информацию о контейнере

source: Container action error
ru: Ошибка при работе с контейнером

source: Container stop error
ru: Ошибка остановки контейнера

source: Stopping container
ru: Идет остановка контейнера

source: Container start error
ru: Ошибка запуска контейнера

source: Starting container
ru: Идет запуск контейнера

source: Container unpause error
ru: Ошибка запуска контейнера

source: Container state is unknown
ru: Неизвестное состояние контейнера

source: No containers
ru: Список контейнеров пуст

source: Sort by:
ru: Сортировать по:
